In [65]:
import pandas as pd
df = pd.read_csv(r"C:\Users\singh\OneDrive\Desktop\Python\Data\covid_toy.csv")
df

    age  gender  fever   cough       city has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]

In [66]:
## Question 1. 
categorical = df.select_dtypes(include = ["object"])
numerical = df.select_dtypes(exclude = ["object"])
categorical

    gender   cough       city has_covid
0     Male    Mild    Kolkata        No
1     Male    Mild      Delhi       Yes
2     Male    Mild      Delhi        No
3   Female    Mild    Kolkata        No
4   Female    Mild     Mumbai        No
..     ...     ...        ...       ...
95  Female    Mild  Bangalore        No
96  Female  Strong    Kolkata       Yes
97  Female    Mild  Bangalore        No
98  Female  Strong     Mumbai        No
99  Female  Strong    Kolkata       Yes

[100 rows x 4 columns]

In [67]:
categorical

    gender   cough       city has_covid
0     Male    Mild    Kolkata        No
1     Male    Mild      Delhi       Yes
2     Male    Mild      Delhi        No
3   Female    Mild    Kolkata        No
4   Female    Mild     Mumbai        No
..     ...     ...        ...       ...
95  Female    Mild  Bangalore        No
96  Female  Strong    Kolkata       Yes
97  Female    Mild  Bangalore        No
98  Female  Strong     Mumbai        No
99  Female  Strong    Kolkata       Yes

[100 rows x 4 columns]

In [68]:
numerical

    age  fever
0    60  103.0
1    27  100.0
2    42  101.0
3    31   98.0
4    65  101.0
..  ...    ...
95   12  104.0
96   51  101.0
97   20  101.0
98    5   98.0
99   10   98.0

[100 rows x 2 columns]

In [69]:
categorical['gender'] = categorical['gender'].map({"Male" : 1, "Female" : 0})
categorical['cough'] = categorical['cough'].map({"Mild" : 0, "Strong": 1})
categorical['has_covid'] = categorical['has_covid'].map({"Yes" : 1, "No" : 0})
categorical['city'] = categorical['city'].map({"Delhi" : 0, "Kolkata" : 1, "Bangalore" : 2, "Mumbai" : 3})

In [70]:
categorical

    gender  cough  city  has_covid
0        1      0     1          0
1        1      0     0          1
2        1      0     0          0
3        0      0     1          0
4        0      0     3          0
..     ...    ...   ...        ...
95       0      0     2          0
96       0      1     1          1
97       0      0     2          0
98       0      1     3          0
99       0      1     1          1

[100 rows x 4 columns]

In [71]:
## Question 2. 
df.isnull().sum()

new_df = df.fillna(df['fever'].mean())
new_df.isnull().sum()

age          0
gender       0
fever        0
cough        0
city         0
has_covid    0
dtype: int64

In [72]:
## Question 3.
df.rename(columns=
    {"age" : "Age",
     "gender" : "Sex",
     "city" : "Living"})

    Age     Sex  fever   cough     Living has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]

In [73]:
## Question 4.
categorical.loc[15:25]

    gender  cough  city  has_covid
15       1      1     1          1
16       0      0     1          1
17       0      1     0          0
18       0      0     2          1
19       0      1     2          1
20       1      1     2          0
21       1      0     2          1
22       0      1     1          1
23       0      0     0          1
24       0      1     1          0
25       1      0     3          0

In [74]:
## Question 5.
numerical.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

In [75]:
#Question 6. 
categorical.to_csv("CategoricalCovid.csv", index= False)

In [76]:
numerical.to_excel("NumericalCovid.xlsx", index= False)

In [77]:
#Question 7. 
numerical.sort_values(by= "age", inplace= True, ascending= True)
numerical

    age  fever
88    5  100.0
98    5   98.0
75    5  102.0
59    6  104.0
77    8  101.0
..  ...    ...
41   82    NaN
31   83  103.0
53   83   98.0
72   83  101.0
5    84    NaN

[100 rows x 2 columns]

In [78]:
df

    age  gender  fever   cough       city has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]